/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const EINVAL: u32 = 22;
pub const ERANGE: u32 = 34;
pub const EILSEQ: u32 = 42;
pub const STRUNCATE: u32 = 80;
pub const EDEADLOCK: u32 = 36;
pub const EADDRINUSE: u32 = 100;
pub const EADDRNOTAVAIL: u32 = 101;
pub const EAFNOSUPPORT: u32 = 102;
pub const EALREADY: u32 = 103;
pub const EBADMSG: u32 = 104;
pub const ECANCELED: u32 = 105;
pub const ECONNABORTED: u32 = 106;
pub const ECONNREFUSED: u32 = 107;
pub const ECONNRESET: u32 = 108;
pub const EDESTADDRREQ: u32 = 109;
pub const EHOSTUNREACH: u32 = 110;
pub const EIDRM: u32 = 111;
pub const EINPROGRESS: u32 = 112;
pub const EISCONN: u32 = 113;
pub const ELOOP: u32 = 114;
pub const EMSGSIZE: u32 = 115;
pub const ENETDOWN: u32 = 116;
pub const ENETRESET: u32 = 117;
pub const ENETUNREACH: u32 = 118;
pub const ENOBUFS: u32 = 119;
pub const ENODATA: u32 = 120;
pub const ENOLINK: u32 = 121;
pub const ENOMSG: u32 = 122;
pub const ENOPROTOOPT: u32 = 123;
pub const ENOSR: u32 = 124;
pub const ENOSTR: u32 = 125;
pub const ENOTCONN: u32 = 126;
pub const ENOTRECOVERABLE: u32 = 127;
pub const ENOTSOCK: u32 = 128;
pub const ENOTSUP: u32 = 129;
pub const EOPNOTSUPP: u32 = 130;
pub const EOTHER: u32 = 131;
pub const EOVERFLOW: u32 = 132;
pub const EOWNERDEAD: u32 = 133;
pub const EPROTO: u32 = 134;
pub const EPROTONOSUPPORT: u32 = 135;
pub const EPROTOTYPE: u32 = 136;
pub const ETIME: u32 = 137;
pub const ETIMEDOUT: u32 = 138;
pub const ETXTBSY: u32 = 139;
pub const EWOULDBLOCK: u32 = 140;
pub const _NLSCMPERROR: u32 = 2147483647;
pub const UNDEF_TYPE: i32 = -1;
pub const HVECTOR_UNDEF: u32 = 0;
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn _calloc_base(_Count: usize, _Size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn calloc(
        _Count: ::std::os::raw::c_ulonglong,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _callnewh(_Size: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _expand(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _free_base(_Block: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn free(_Block: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _malloc_base(_Size: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn malloc(_Size: ::std::os::raw::c_ulonglong) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _msize_base(_Block: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn _msize(_Block: *mut ::std::os::raw::c_void) -> usize;
}
unsafe extern "C" {
    pub fn _realloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _recalloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_free(_Block: *mut ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _aligned_malloc(_Size: usize, _Alignment: usize) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_offset_malloc(
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_msize(
        _Block: *mut ::std::os::raw::c_void,
        _Alignment: usize,
        _Offset: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _aligned_offset_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_offset_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _aligned_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
pub type max_align_t = f64;
pub type _CoreCrtSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
unsafe extern "C" {
    pub fn bsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort_s(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn bsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn qsort(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
unsafe extern "C" {
    pub fn _lfind_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _lsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _itow_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _itow(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ltow_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ltow(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ultow_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ultow(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn _wcstod_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
unsafe extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _wcstol_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoll_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _wcstoul_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wcstoull_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn _wcstold_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
unsafe extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
unsafe extern "C" {
    pub fn _wcstof_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f32;
}
unsafe extern "C" {
    pub fn _wtof(_String: *const wchar_t) -> f64;
}
unsafe extern "C" {
    pub fn _wtof_l(_String: *const wchar_t, _Locale: _locale_t) -> f64;
}
unsafe extern "C" {
    pub fn _wtoi(_String: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wtoi_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wtol(_String: *const wchar_t) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _wtol_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _wtoll(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wtoll_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _i64tow_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _i64tow(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _ui64tow_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ui64tow(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wtoi64(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wtoi64_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoi64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoi64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _wcstoui64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wcstoui64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _wfullpath(
        _Buffer: *mut wchar_t,
        _Path: *const wchar_t,
        _BufferCount: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wmakepath_s(
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wmakepath(
        _Buffer: *mut wchar_t,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    );
}
unsafe extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
unsafe extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _Dir: *mut wchar_t,
        _Filename: *mut wchar_t,
        _Ext: *mut wchar_t,
    );
}
unsafe extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _DriveCount: usize,
        _Dir: *mut wchar_t,
        _DirCount: usize,
        _Filename: *mut wchar_t,
        _FilenameCount: usize,
        _Ext: *mut wchar_t,
        _ExtCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut wchar_t,
        _BufferCount: *mut usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wgetenv(_VarName: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wgetenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wputenv(_EnvString: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wputenv_s(_Name: *const wchar_t, _Value: *const wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wsearchenv(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _ResultPath: *mut wchar_t,
    );
}
unsafe extern "C" {
    pub fn _wsystem(_Command: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn exit(_Code: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _exit(_Code: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn _Exit(_Code: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn quick_exit(_Code: ::std::os::raw::c_int) -> !;
}
unsafe extern "C" {
    pub fn abort() -> !;
}
unsafe extern "C" {
    pub fn _set_abort_behavior(
        _Flags: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
pub type _onexit_t = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
unsafe extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _onexit(_Func: _onexit_t) -> _onexit_t;
}
unsafe extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type _purecall_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: ::std::os::raw::c_uint,
        arg5: usize,
    ),
>;
unsafe extern "C" {
    pub fn _set_purecall_handler(_Handler: _purecall_handler) -> _purecall_handler;
}
unsafe extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
unsafe extern "C" {
    pub fn _set_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
unsafe extern "C" {
    pub fn _get_invalid_parameter_handler() -> _invalid_parameter_handler;
}
unsafe extern "C" {
    pub fn _set_thread_local_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
unsafe extern "C" {
    pub fn _get_thread_local_invalid_parameter_handler() -> _invalid_parameter_handler;
}
unsafe extern "C" {
    pub fn _set_error_mode(_Mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
unsafe extern "C" {
    pub fn __sys_errlist() -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __sys_nerr() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn perror(_ErrMsg: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    pub fn __p__pgmptr() -> *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __p__wpgmptr() -> *mut *mut wchar_t;
}
unsafe extern "C" {
    pub fn __p__fmode() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _get_pgmptr(_Value: *mut *mut ::std::os::raw::c_char) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_wpgmptr(_Value: *mut *mut wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _set_fmode(_Mode: ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_fmode(_PMode: *mut ::std::os::raw::c_int) -> errno_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _div_t"][::std::mem::size_of::<_div_t>() - 8usize];
    ["Alignment of _div_t"][::std::mem::align_of::<_div_t>() - 4usize];
    ["Offset of field: _div_t::quot"][::std::mem::offset_of!(_div_t, quot) - 0usize];
    ["Offset of field: _div_t::rem"][::std::mem::offset_of!(_div_t, rem) - 4usize];
};
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ldiv_t"][::std::mem::size_of::<_ldiv_t>() - 8usize];
    ["Alignment of _ldiv_t"][::std::mem::align_of::<_ldiv_t>() - 4usize];
    ["Offset of field: _ldiv_t::quot"][::std::mem::offset_of!(_ldiv_t, quot) - 0usize];
    ["Offset of field: _ldiv_t::rem"][::std::mem::offset_of!(_ldiv_t, rem) - 4usize];
};
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _lldiv_t"][::std::mem::size_of::<_lldiv_t>() - 16usize];
    ["Alignment of _lldiv_t"][::std::mem::align_of::<_lldiv_t>() - 8usize];
    ["Offset of field: _lldiv_t::quot"][::std::mem::offset_of!(_lldiv_t, quot) - 0usize];
    ["Offset of field: _lldiv_t::rem"][::std::mem::offset_of!(_lldiv_t, rem) - 8usize];
};
pub type lldiv_t = _lldiv_t;
unsafe extern "C" {
    pub fn abs(_Number: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn labs(_Number: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn llabs(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _abs64(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _byteswap_ushort(_Number: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn _byteswap_ulong(_Number: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _byteswap_uint64(_Number: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn div(_Numerator: ::std::os::raw::c_int, _Denominator: ::std::os::raw::c_int) -> div_t;
}
unsafe extern "C" {
    pub fn ldiv(_Numerator: ::std::os::raw::c_long, _Denominator: ::std::os::raw::c_long)
    -> ldiv_t;
}
unsafe extern "C" {
    pub fn lldiv(
        _Numerator: ::std::os::raw::c_longlong,
        _Denominator: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
unsafe extern "C" {
    pub fn _rotl(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _lrotl(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _rotl64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _rotr(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _lrotr(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _rotr64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn srand(_Seed: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDOUBLE {
    pub ld: [::std::os::raw::c_uchar; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDOUBLE"][::std::mem::size_of::<_LDOUBLE>() - 10usize];
    ["Alignment of _LDOUBLE"][::std::mem::align_of::<_LDOUBLE>() - 1usize];
    ["Offset of field: _LDOUBLE::ld"][::std::mem::offset_of!(_LDOUBLE, ld) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CRT_DOUBLE"][::std::mem::size_of::<_CRT_DOUBLE>() - 8usize];
    ["Alignment of _CRT_DOUBLE"][::std::mem::align_of::<_CRT_DOUBLE>() - 8usize];
    ["Offset of field: _CRT_DOUBLE::x"][::std::mem::offset_of!(_CRT_DOUBLE, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CRT_FLOAT"][::std::mem::size_of::<_CRT_FLOAT>() - 4usize];
    ["Alignment of _CRT_FLOAT"][::std::mem::align_of::<_CRT_FLOAT>() - 4usize];
    ["Offset of field: _CRT_FLOAT::f"][::std::mem::offset_of!(_CRT_FLOAT, f) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LONGDOUBLE"][::std::mem::size_of::<_LONGDOUBLE>() - 8usize];
    ["Alignment of _LONGDOUBLE"][::std::mem::align_of::<_LONGDOUBLE>() - 8usize];
    ["Offset of field: _LONGDOUBLE::x"][::std::mem::offset_of!(_LONGDOUBLE, x) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDBL12 {
    pub ld12: [::std::os::raw::c_uchar; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDBL12"][::std::mem::size_of::<_LDBL12>() - 12usize];
    ["Alignment of _LDBL12"][::std::mem::align_of::<_LDBL12>() - 1usize];
    ["Offset of field: _LDBL12::ld12"][::std::mem::offset_of!(_LDBL12, ld12) - 0usize];
};
unsafe extern "C" {
    pub fn atof(_String: *const ::std::os::raw::c_char) -> f64;
}
unsafe extern "C" {
    pub fn atoi(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn atol(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn atoll(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _atoi64(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _atof_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> f64;
}
unsafe extern "C" {
    pub fn _atoi_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atol_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _atoll_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _atoi64_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _atoflt(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atodbl(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atoldbl(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atoflt_l(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atodbl_l(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _atoldbl_l(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strtof(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
unsafe extern "C" {
    pub fn _strtof_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f32;
}
unsafe extern "C" {
    pub fn strtod(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn _strtod_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtold(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
unsafe extern "C" {
    pub fn _strtold_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
unsafe extern "C" {
    pub fn strtol(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _strtol_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn strtoll(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _strtoll_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn strtoul(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _strtoul_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strtoull(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strtoull_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strtoi64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _strtoi64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _strtoui64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strtoui64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _itoa_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _ltoa_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _ultoa_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _i64toa_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _i64toa(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _ui64toa_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ui64toa(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _ecvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _fcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _gcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ___mb_cur_max_func() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mblen(_Ch: *const ::std::os::raw::c_char, _MaxCount: usize) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mblen_l(
        _Ch: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mbstrlen(_String: *const ::std::os::raw::c_char) -> usize;
}
unsafe extern "C" {
    pub fn _mbstrlen_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> usize;
}
unsafe extern "C" {
    pub fn _mbstrnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn _mbstrnlen_l(
        _String: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _mbtowc_l(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn mbstowcs(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _mbstowcs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _mbstowcs_l(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wctomb(_MbCh: *mut ::std::os::raw::c_char, _WCh: wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wctomb_l(
        _MbCh: *mut ::std::os::raw::c_char,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wctomb_s_l(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstombs(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _wcstombs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcstombs_l(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn _fullpath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Path: *const ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _makepath_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _makepath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn _splitpath(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _Dir: *mut ::std::os::raw::c_char,
        _Filename: *mut ::std::os::raw::c_char,
        _Ext: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn _splitpath_s(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _DriveCount: usize,
        _Dir: *mut ::std::os::raw::c_char,
        _DirCount: usize,
        _Filename: *mut ::std::os::raw::c_char,
        _FilenameCount: usize,
        _Ext: *mut ::std::os::raw::c_char,
        _ExtCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: rsize_t,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn __p___argc() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __p___argv() -> *mut *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __p___wargv() -> *mut *mut *mut wchar_t;
}
unsafe extern "C" {
    pub fn __p__environ() -> *mut *mut *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __p__wenviron() -> *mut *mut *mut wchar_t;
}
unsafe extern "C" {
    pub fn getenv(_VarName: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _dupenv_s(
        _Buffer: *mut *mut ::std::os::raw::c_char,
        _BufferCount: *mut usize,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn system(_Command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _putenv_s(
        _Name: *const ::std::os::raw::c_char,
        _Value: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _searchenv_s(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _searchenv(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
    );
}
unsafe extern "C" {
    pub fn _seterrormode(_Mode: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn _beep(_Frequency: ::std::os::raw::c_uint, _Duration: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn _sleep(_Duration: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _DstBuf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
unsafe extern "C" {
    pub fn _clearfp() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _controlfp(
        _NewValue: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _set_controlfp(_NewValue: ::std::os::raw::c_uint, _Mask: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn _controlfp_s(
        _CurrentState: *mut ::std::os::raw::c_uint,
        _NewValue: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _statusfp() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _fpreset();
}
unsafe extern "C" {
    pub fn _control87(
        _NewValue: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn __fpecode() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __fpe_flt_rounds() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _copysign(_Number: f64, _Sign: f64) -> f64;
}
unsafe extern "C" {
    pub fn _chgsign(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _scalb(_X: f64, _Y: ::std::os::raw::c_long) -> f64;
}
unsafe extern "C" {
    pub fn _logb(_X: f64) -> f64;
}
unsafe extern "C" {
    pub fn _nextafter(_X: f64, _Y: f64) -> f64;
}
unsafe extern "C" {
    pub fn _finite(_X: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isnan(_X: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _fpclass(_X: f64) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _scalbf(_X: f32, _Y: ::std::os::raw::c_long) -> f32;
}
unsafe extern "C" {
    pub fn fpreset();
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type HBOOL = bool;
pub type HBYTE = u8;
pub type HINT = ::std::os::raw::c_int;
pub type HUINT = ::std::os::raw::c_uint;
pub type DOUBLE8 = f64;
pub type INT1 = i8;
pub type UINT1 = u8;
pub type INT2 = i16;
pub type UINT2 = u16;
pub type INT4 = i32;
pub type UINT4 = u32;
pub type HINT4_8 = ::std::os::raw::c_longlong;
pub type INT4_8 = ::std::os::raw::c_longlong;
pub type UINT4_8 = ::std::os::raw::c_ulonglong;
pub type Hlong = INT4_8;
pub type Hulong = UINT4_8;
pub type HINT8 = i64;
pub type HUINT8 = u64;
pub type MACHINE_WORD = isize;
pub type VOIDP = *mut ::std::os::raw::c_void;
pub type Herror = u32;
pub type Hkey = *mut ::std::os::raw::c_long;
pub type Hproc_handle = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HStreamBufferT {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HhandleListT {
    _unused: [u8; 0],
}
#[doc = "< No signal"]
pub const HSignalTypeEnum_eSignalNone: HSignalTypeEnum = 0;
#[doc = "< Initiate abort: stop running, abort mutexes etc."]
pub const HSignalTypeEnum_eSignalStartAbort: HSignalTypeEnum = 1;
#[doc = "< Finalize abort, wait for resources to finish"]
pub const HSignalTypeEnum_eSignalAbort: HSignalTypeEnum = 2;
#[doc = "< After abortion is complete, restore mutexes etc."]
pub const HSignalTypeEnum_eSignalRestore: HSignalTypeEnum = 3;
#[doc = "/\n/** HSignalTypeEnum: List of signals that can be sent to handles\n\n This enum defines a set of signals that can be sent to the\n signalling callback of handles.  Note that the callback functions must\n ignore any signal that they do not understand."]
pub type HSignalTypeEnum = ::std::os::raw::c_int;
pub type HHandleSerializeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: Hproc_handle,
        arg2: *mut HStreamBufferT,
        arg3: *mut ::std::os::raw::c_void,
    ) -> Herror,
>;
pub type HHandleDeserializeFunc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: Hproc_handle,
        arg2: *mut HStreamBufferT,
        arg3: *mut *mut ::std::os::raw::c_void,
    ) -> Herror,
>;
pub type HHandleDestructorFunc = ::std::option::Option<
    unsafe extern "C" fn(arg1: Hproc_handle, arg2: *mut ::std::os::raw::c_void) -> Herror,
>;
pub type HHandleSignalFunc = ::std::option::Option<
    unsafe extern "C" fn(signal: HSignalTypeEnum, arg1: *mut ::std::os::raw::c_void) -> Herror,
>;
#[doc = "/\n/** HHandleInfo holds handle type information.\n\n This structure exists once per handle type (usually per sem_type).\n It contains basic, static, constant information about that type.\n Most notably, it contains pointers to the functions that operate on the\n handles (clear, serialize, deserialize and signal).\n\n Handles (instances) of types where the cb_signal callback is not NULL are\n stored in a list that allows calling the signal callback for each of them.\n\n All serialized items must have a unique header, usually a string, that\n identifies them. 'header' contains a pointer to that header, allowing\n other functions to identify a serialized item based on its header.\n If no (de)serialization function is set, header must be NULL.\n\n \\ingroup data_structures_handles"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct H_HANDLE_TYPE {
    #[doc = "< Type ID"]
    pub type_id: INT4_8,
    #[doc = "< sem_type of the handle"]
    pub sem_type: *const ::std::os::raw::c_char,
    #[doc = "< Serialize this handle type"]
    pub cb_serialize: HHandleSerializeFunc,
    #[doc = "< Deserialize this handle type"]
    pub cb_deserialize: HHandleDeserializeFunc,
    #[doc = "< Serialization header"]
    pub header: *const ::std::os::raw::c_char,
    #[doc = "< Clear this handle type"]
    pub cb_clear: HHandleDestructorFunc,
    #[doc = "< Signal (for semaphores etc.)"]
    pub cb_signal: HHandleSignalFunc,
    #[doc = "< List of handles, or NULL"]
    pub list: *mut HhandleListT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of H_HANDLE_TYPE"][::std::mem::size_of::<H_HANDLE_TYPE>() - 64usize];
    ["Alignment of H_HANDLE_TYPE"][::std::mem::align_of::<H_HANDLE_TYPE>() - 8usize];
    ["Offset of field: H_HANDLE_TYPE::type_id"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, type_id) - 0usize];
    ["Offset of field: H_HANDLE_TYPE::sem_type"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, sem_type) - 8usize];
    ["Offset of field: H_HANDLE_TYPE::cb_serialize"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, cb_serialize) - 16usize];
    ["Offset of field: H_HANDLE_TYPE::cb_deserialize"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, cb_deserialize) - 24usize];
    ["Offset of field: H_HANDLE_TYPE::header"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, header) - 32usize];
    ["Offset of field: H_HANDLE_TYPE::cb_clear"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, cb_clear) - 40usize];
    ["Offset of field: H_HANDLE_TYPE::cb_signal"]
        [::std::mem::offset_of!(H_HANDLE_TYPE, cb_signal) - 48usize];
    ["Offset of field: H_HANDLE_TYPE::list"][::std::mem::offset_of!(H_HANDLE_TYPE, list) - 56usize];
};
#[doc = "/\n/** HHandleInfo holds handle type information.\n\n This structure exists once per handle type (usually per sem_type).\n It contains basic, static, constant information about that type.\n Most notably, it contains pointers to the functions that operate on the\n handles (clear, serialize, deserialize and signal).\n\n Handles (instances) of types where the cb_signal callback is not NULL are\n stored in a list that allows calling the signal callback for each of them.\n\n All serialized items must have a unique header, usually a string, that\n identifies them. 'header' contains a pointer to that header, allowing\n other functions to identify a serialized item based on its header.\n If no (de)serialization function is set, header must be NULL.\n\n \\ingroup data_structures_handles"]
pub type HHandleInfo = H_HANDLE_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HhandleT {
    _unused: [u8; 0],
}
pub type Hphandle = *mut HhandleT;
#[repr(C)]
#[derive(Copy, Clone)]
pub union Hpar {
    pub l: INT4_8,
    pub d: f64,
    pub s: *mut ::std::os::raw::c_char,
    pub h: Hphandle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hpar"][::std::mem::size_of::<Hpar>() - 8usize];
    ["Alignment of Hpar"][::std::mem::align_of::<Hpar>() - 8usize];
    ["Offset of field: Hpar::l"][::std::mem::offset_of!(Hpar, l) - 0usize];
    ["Offset of field: Hpar::d"][::std::mem::offset_of!(Hpar, d) - 0usize];
    ["Offset of field: Hpar::s"][::std::mem::offset_of!(Hpar, s) - 0usize];
    ["Offset of field: Hpar::h"][::std::mem::offset_of!(Hpar, h) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Hcpar {
    pub par: Hpar,
    pub type_: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hcpar"][::std::mem::size_of::<Hcpar>() - 16usize];
    ["Alignment of Hcpar"][::std::mem::align_of::<Hcpar>() - 8usize];
    ["Offset of field: Hcpar::par"][::std::mem::offset_of!(Hcpar, par) - 0usize];
    ["Offset of field: Hcpar::type_"][::std::mem::offset_of!(Hcpar, type_) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union Hcelem {
    pub l: *mut INT4_8,
    pub d: *mut f64,
    pub s: *mut *mut ::std::os::raw::c_char,
    pub cpar: *mut Hcpar,
    pub h: *mut Hphandle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hcelem"][::std::mem::size_of::<Hcelem>() - 8usize];
    ["Alignment of Hcelem"][::std::mem::align_of::<Hcelem>() - 8usize];
    ["Offset of field: Hcelem::l"][::std::mem::offset_of!(Hcelem, l) - 0usize];
    ["Offset of field: Hcelem::d"][::std::mem::offset_of!(Hcelem, d) - 0usize];
    ["Offset of field: Hcelem::s"][::std::mem::offset_of!(Hcelem, s) - 0usize];
    ["Offset of field: Hcelem::cpar"][::std::mem::offset_of!(Hcelem, cpar) - 0usize];
    ["Offset of field: Hcelem::h"][::std::mem::offset_of!(Hcelem, h) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Hctuple {
    pub val: Hcpar,
    pub num: INT4_8,
    pub capacity: INT4_8,
    pub flags: ::std::os::raw::c_int,
    pub elem: Hcelem,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hctuple"][::std::mem::size_of::<Hctuple>() - 48usize];
    ["Alignment of Hctuple"][::std::mem::align_of::<Hctuple>() - 8usize];
    ["Offset of field: Hctuple::val"][::std::mem::offset_of!(Hctuple, val) - 0usize];
    ["Offset of field: Hctuple::num"][::std::mem::offset_of!(Hctuple, num) - 16usize];
    ["Offset of field: Hctuple::capacity"][::std::mem::offset_of!(Hctuple, capacity) - 24usize];
    ["Offset of field: Hctuple::flags"][::std::mem::offset_of!(Hctuple, flags) - 32usize];
    ["Offset of field: Hctuple::elem"][::std::mem::offset_of!(Hctuple, elem) - 40usize];
};
pub type H_pthread_t = *mut ::std::os::raw::c_void;
pub type H_pthread_mutex_t = *mut ::std::os::raw::c_void;
pub type H_pthread_cond_t = *mut ::std::os::raw::c_void;
pub type H_pthread_barrier_t = *mut ::std::os::raw::c_void;
pub type HDrawObjectCallback = ::std::option::Option<
    unsafe extern "C" fn(
        DrawHandle: Hphandle,
        WindowHandle: Hphandle,
        type_: *mut ::std::os::raw::c_char,
    ) -> Herror,
>;
pub type HUpdateContentCallback =
    ::std::option::Option<unsafe extern "C" fn(context: *mut ::std::os::raw::c_void) -> Herror>;
pub type HLicenseRecheckFailedCallback = ::std::option::Option<
    unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, error: Herror),
>;
unsafe extern "C" {
    pub static mut HDoLowError: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut HLowErrorAction: [i32; 4usize];
}
unsafe extern "C" {
    pub static mut HDoMessageBoxOnError: i32;
}
unsafe extern "C" {
    pub static mut HDoLicenseError: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut HUseSpinLock: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut HStartUpThreadPool: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut HShutdownThreadPool: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut HShuttingDown: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HSetDoMessageBoxOnError(value: i32);
}
unsafe extern "C" {
    pub fn HSetDoLicenseError(value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn HSetUseSpinLock(value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn HSetStartUpThreadPool(value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn HSetShutdownThreadPool(value: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn HGetDoMessageBoxOnError() -> i32;
}
unsafe extern "C" {
    pub fn HGetDoLicenseError() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HGetUseSpinLock() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HGetStartUpThreadPool() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HGetShutdownThreadPool() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HGetShuttingDown() -> ::std::os::raw::c_int;
}
pub const eHMemoryAllocatorType_eHMemoryAllocatorTypeInvalid: eHMemoryAllocatorType = -1;
pub const eHMemoryAllocatorType_eHMemoryAllocatorTypeSystem: eHMemoryAllocatorType = 0;
pub const eHMemoryAllocatorType_eHMemoryAllocatorTypeMiMalloc: eHMemoryAllocatorType = 1;
pub type eHMemoryAllocatorType = ::std::os::raw::c_int;
unsafe extern "C" {
    pub fn HGetMemoryAllocatorType() -> eHMemoryAllocatorType;
}
unsafe extern "C" {
    pub fn HSetMemoryAllocatorType(allocator: eHMemoryAllocatorType) -> Herror;
}
unsafe extern "C" {
    pub fn HSetHDevelopInt(AccessByHDevelop: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn HGetHDevelopInt() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn HSetLicenseRecheckFailedCallback(
        callback: HLicenseRecheckFailedCallback,
        context: *mut ::std::os::raw::c_void,
    );
}
unsafe extern "C" {
    pub fn FinalizeHALCONLibrary() -> ::std::os::raw::c_int;
}
pub type HProgressBarCallback = ::std::option::Option<
    unsafe extern "C" fn(
        id: Hlong,
        operator_name: *const ::std::os::raw::c_char,
        progress: f64,
        message: *const ::std::os::raw::c_char,
    ),
>;
unsafe extern "C" {
    pub fn HVerifyXMLFile(
        path: *const ::std::os::raw::c_char,
        pk: *const ::std::os::raw::c_void,
    ) -> Herror;
}
pub type HIMGDIM = i32;
pub type HIMGCOOR = i16;
pub type HLINCOOR = i32;
pub type HIMGCNT = i32;
pub type HITEMCNT = i32;
pub type HSUBCOOR = f32;
pub type HSUBATTR = f32;
pub type HImageAllocProc =
    ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void>;
pub type HImageFreeProc =
    ::std::option::Option<unsafe extern "C" fn(mem: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HComplexPixel {
    pub re: f32,
    pub im: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HComplexPixel"][::std::mem::size_of::<HComplexPixel>() - 8usize];
    ["Alignment of HComplexPixel"][::std::mem::align_of::<HComplexPixel>() - 4usize];
    ["Offset of field: HComplexPixel::re"][::std::mem::offset_of!(HComplexPixel, re) - 0usize];
    ["Offset of field: HComplexPixel::im"][::std::mem::offset_of!(HComplexPixel, im) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HInt2Pixel {
    pub p: *mut i16,
    pub num_bits: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HInt2Pixel"][::std::mem::size_of::<HInt2Pixel>() - 16usize];
    ["Alignment of HInt2Pixel"][::std::mem::align_of::<HInt2Pixel>() - 8usize];
    ["Offset of field: HInt2Pixel::p"][::std::mem::offset_of!(HInt2Pixel, p) - 0usize];
    ["Offset of field: HInt2Pixel::num_bits"]
        [::std::mem::offset_of!(HInt2Pixel, num_bits) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HUInt2Pixel {
    pub p: *mut u16,
    pub num_bits: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HUInt2Pixel"][::std::mem::size_of::<HUInt2Pixel>() - 16usize];
    ["Alignment of HUInt2Pixel"][::std::mem::align_of::<HUInt2Pixel>() - 8usize];
    ["Offset of field: HUInt2Pixel::p"][::std::mem::offset_of!(HUInt2Pixel, p) - 0usize];
    ["Offset of field: HUInt2Pixel::num_bits"]
        [::std::mem::offset_of!(HUInt2Pixel, num_bits) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HVFPixel {
    pub row: *mut f32,
    pub col: *mut f32,
    pub kind: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HVFPixel"][::std::mem::size_of::<HVFPixel>() - 24usize];
    ["Alignment of HVFPixel"][::std::mem::align_of::<HVFPixel>() - 8usize];
    ["Offset of field: HVFPixel::row"][::std::mem::offset_of!(HVFPixel, row) - 0usize];
    ["Offset of field: HVFPixel::col"][::std::mem::offset_of!(HVFPixel, col) - 8usize];
    ["Offset of field: HVFPixel::kind"][::std::mem::offset_of!(HVFPixel, kind) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union HPixelImage {
    pub b: *mut u8,
    pub z: *mut u8,
    pub d: *mut u8,
    pub i: *mut i8,
    pub l: *mut i32,
    pub i8_: *mut i64,
    pub f: *mut f32,
    pub vf: HVFPixel,
    pub c: *mut HComplexPixel,
    pub s: HInt2Pixel,
    pub u: HUInt2Pixel,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HPixelImage"][::std::mem::size_of::<HPixelImage>() - 24usize];
    ["Alignment of HPixelImage"][::std::mem::align_of::<HPixelImage>() - 8usize];
    ["Offset of field: HPixelImage::b"][::std::mem::offset_of!(HPixelImage, b) - 0usize];
    ["Offset of field: HPixelImage::z"][::std::mem::offset_of!(HPixelImage, z) - 0usize];
    ["Offset of field: HPixelImage::d"][::std::mem::offset_of!(HPixelImage, d) - 0usize];
    ["Offset of field: HPixelImage::i"][::std::mem::offset_of!(HPixelImage, i) - 0usize];
    ["Offset of field: HPixelImage::l"][::std::mem::offset_of!(HPixelImage, l) - 0usize];
    ["Offset of field: HPixelImage::i8_"][::std::mem::offset_of!(HPixelImage, i8_) - 0usize];
    ["Offset of field: HPixelImage::f"][::std::mem::offset_of!(HPixelImage, f) - 0usize];
    ["Offset of field: HPixelImage::vf"][::std::mem::offset_of!(HPixelImage, vf) - 0usize];
    ["Offset of field: HPixelImage::c"][::std::mem::offset_of!(HPixelImage, c) - 0usize];
    ["Offset of field: HPixelImage::s"][::std::mem::offset_of!(HPixelImage, s) - 0usize];
    ["Offset of field: HPixelImage::u"][::std::mem::offset_of!(HPixelImage, u) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Himage {
    pub kind: ::std::os::raw::c_int,
    pub pixel: HPixelImage,
    pub width: HIMGDIM,
    pub height: HIMGDIM,
    pub free_proc: HImageFreeProc,
    pub free: bool,
    pub msec: u16,
    pub sec: u8,
    pub min: u8,
    pub hour: u8,
    pub day: u8,
    pub yday: u16,
    pub mon: u8,
    pub year: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Himage"][::std::mem::size_of::<Himage>() - 64usize];
    ["Alignment of Himage"][::std::mem::align_of::<Himage>() - 8usize];
    ["Offset of field: Himage::kind"][::std::mem::offset_of!(Himage, kind) - 0usize];
    ["Offset of field: Himage::pixel"][::std::mem::offset_of!(Himage, pixel) - 8usize];
    ["Offset of field: Himage::width"][::std::mem::offset_of!(Himage, width) - 32usize];
    ["Offset of field: Himage::height"][::std::mem::offset_of!(Himage, height) - 36usize];
    ["Offset of field: Himage::free_proc"][::std::mem::offset_of!(Himage, free_proc) - 40usize];
    ["Offset of field: Himage::free"][::std::mem::offset_of!(Himage, free) - 48usize];
    ["Offset of field: Himage::msec"][::std::mem::offset_of!(Himage, msec) - 50usize];
    ["Offset of field: Himage::sec"][::std::mem::offset_of!(Himage, sec) - 52usize];
    ["Offset of field: Himage::min"][::std::mem::offset_of!(Himage, min) - 53usize];
    ["Offset of field: Himage::hour"][::std::mem::offset_of!(Himage, hour) - 54usize];
    ["Offset of field: Himage::day"][::std::mem::offset_of!(Himage, day) - 55usize];
    ["Offset of field: Himage::yday"][::std::mem::offset_of!(Himage, yday) - 56usize];
    ["Offset of field: Himage::mon"][::std::mem::offset_of!(Himage, mon) - 58usize];
    ["Offset of field: Himage::year"][::std::mem::offset_of!(Himage, year) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Himage_exp {
    pub width: i32,
    pub kind: i32,
    pub height: i32,
    pub info: [::std::os::raw::c_char; 996usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Himage_exp"][::std::mem::size_of::<Himage_exp>() - 1008usize];
    ["Alignment of Himage_exp"][::std::mem::align_of::<Himage_exp>() - 4usize];
    ["Offset of field: Himage_exp::width"][::std::mem::offset_of!(Himage_exp, width) - 0usize];
    ["Offset of field: Himage_exp::kind"][::std::mem::offset_of!(Himage_exp, kind) - 4usize];
    ["Offset of field: Himage_exp::height"][::std::mem::offset_of!(Himage_exp, height) - 8usize];
    ["Offset of field: Himage_exp::info"][::std::mem::offset_of!(Himage_exp, info) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Himage_hobj_file_header {
    pub version_number: i32,
    pub num_images: i32,
    pub is_msb_first: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Himage_hobj_file_header"][::std::mem::size_of::<Himage_hobj_file_header>() - 12usize];
    ["Alignment of Himage_hobj_file_header"]
        [::std::mem::align_of::<Himage_hobj_file_header>() - 4usize];
    ["Offset of field: Himage_hobj_file_header::version_number"]
        [::std::mem::offset_of!(Himage_hobj_file_header, version_number) - 0usize];
    ["Offset of field: Himage_hobj_file_header::num_images"]
        [::std::mem::offset_of!(Himage_hobj_file_header, num_images) - 4usize];
    ["Offset of field: Himage_hobj_file_header::is_msb_first"]
        [::std::mem::offset_of!(Himage_hobj_file_header, is_msb_first) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Himage_hobj_image_header {
    pub width: i32,
    pub height: i32,
    pub num_channels: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Himage_hobj_image_header"]
        [::std::mem::size_of::<Himage_hobj_image_header>() - 12usize];
    ["Alignment of Himage_hobj_image_header"]
        [::std::mem::align_of::<Himage_hobj_image_header>() - 4usize];
    ["Offset of field: Himage_hobj_image_header::width"]
        [::std::mem::offset_of!(Himage_hobj_image_header, width) - 0usize];
    ["Offset of field: Himage_hobj_image_header::height"]
        [::std::mem::offset_of!(Himage_hobj_image_header, height) - 4usize];
    ["Offset of field: Himage_hobj_image_header::num_channels"]
        [::std::mem::offset_of!(Himage_hobj_image_header, num_channels) - 8usize];
};
pub type Hbits = *mut u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hrun {
    pub l: HIMGCOOR,
    pub cb: HIMGCOOR,
    pub ce: HIMGCOOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hrun"][::std::mem::size_of::<Hrun>() - 6usize];
    ["Alignment of Hrun"][::std::mem::align_of::<Hrun>() - 2usize];
    ["Offset of field: Hrun::l"][::std::mem::offset_of!(Hrun, l) - 0usize];
    ["Offset of field: Hrun::cb"][::std::mem::offset_of!(Hrun, cb) - 2usize];
    ["Offset of field: Hrun::ce"][::std::mem::offset_of!(Hrun, ce) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hvrun {
    pub c: HIMGCOOR,
    pub lb: HIMGCOOR,
    pub le: HIMGCOOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hvrun"][::std::mem::size_of::<Hvrun>() - 6usize];
    ["Alignment of Hvrun"][::std::mem::align_of::<Hvrun>() - 2usize];
    ["Offset of field: Hvrun::c"][::std::mem::offset_of!(Hvrun, c) - 0usize];
    ["Offset of field: Hvrun::lb"][::std::mem::offset_of!(Hvrun, lb) - 2usize];
    ["Offset of field: Hvrun::le"][::std::mem::offset_of!(Hvrun, le) - 4usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct HFeatureFlags {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub __bindgen_padding_0: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HFeatureFlags"][::std::mem::size_of::<HFeatureFlags>() - 4usize];
    ["Alignment of HFeatureFlags"][::std::mem::align_of::<HFeatureFlags>() - 4usize];
};
impl HFeatureFlags {
    #[inline]
    pub fn shape(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_shape(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn shape_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_shape_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_convex(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_convex(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_convex_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_convex_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_filled(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_filled(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_filled_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_filled_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_connected4(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_connected4(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_connected4_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_connected4_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_connected8(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_connected8(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_connected8_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_connected8_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn is_thin(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_is_thin(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn is_thin_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_is_thin_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn circularity(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_circularity(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn circularity_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_circularity_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn compactness(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_compactness(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn compactness_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_compactness_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn contlength(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_contlength(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn contlength_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_contlength_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn convexity(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_convexity(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn convexity_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_convexity_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn phi(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_phi(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn phi_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_phi_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn elliptic_axis(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_elliptic_axis(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn elliptic_axis_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_elliptic_axis_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn elliptic_shape(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_elliptic_shape(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn elliptic_shape_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_elliptic_shape_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn excentricity(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_excentricity(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn excentricity_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_excentricity_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn moments(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_moments(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn moments_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_moments_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn center_area(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_center_area(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn center_area_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_center_area_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn smallest_rectangle1(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_smallest_rectangle1(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn smallest_rectangle1_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_smallest_rectangle1_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn smallest_rectangle2(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_smallest_rectangle2(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn smallest_rectangle2_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_smallest_rectangle2_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn smallest_circle(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_smallest_circle(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn smallest_circle_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_smallest_circle_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn min_max_chord(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_min_max_chord(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn min_max_chord_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_min_max_chord_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn min_max_chord_gap(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_min_max_chord_gap(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn min_max_chord_gap_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_min_max_chord_gap_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rectangularity(&self) -> ::std::os::raw::c_uint {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rectangularity(&mut self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rectangularity_raw(this: *const Self) -> ::std::os::raw::c_uint {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 3usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_rectangularity_raw(this: *mut Self, val: ::std::os::raw::c_uint) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 3usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        shape: ::std::os::raw::c_uint,
        is_convex: ::std::os::raw::c_uint,
        is_filled: ::std::os::raw::c_uint,
        is_connected4: ::std::os::raw::c_uint,
        is_connected8: ::std::os::raw::c_uint,
        is_thin: ::std::os::raw::c_uint,
        circularity: ::std::os::raw::c_uint,
        compactness: ::std::os::raw::c_uint,
        contlength: ::std::os::raw::c_uint,
        convexity: ::std::os::raw::c_uint,
        phi: ::std::os::raw::c_uint,
        elliptic_axis: ::std::os::raw::c_uint,
        elliptic_shape: ::std::os::raw::c_uint,
        excentricity: ::std::os::raw::c_uint,
        moments: ::std::os::raw::c_uint,
        center_area: ::std::os::raw::c_uint,
        smallest_rectangle1: ::std::os::raw::c_uint,
        smallest_rectangle2: ::std::os::raw::c_uint,
        smallest_circle: ::std::os::raw::c_uint,
        min_max_chord: ::std::os::raw::c_uint,
        min_max_chord_gap: ::std::os::raw::c_uint,
        rectangularity: ::std::os::raw::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let shape: u32 = unsafe { ::std::mem::transmute(shape) };
            shape as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let is_convex: u32 = unsafe { ::std::mem::transmute(is_convex) };
            is_convex as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let is_filled: u32 = unsafe { ::std::mem::transmute(is_filled) };
            is_filled as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let is_connected4: u32 = unsafe { ::std::mem::transmute(is_connected4) };
            is_connected4 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let is_connected8: u32 = unsafe { ::std::mem::transmute(is_connected8) };
            is_connected8 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let is_thin: u32 = unsafe { ::std::mem::transmute(is_thin) };
            is_thin as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let circularity: u32 = unsafe { ::std::mem::transmute(circularity) };
            circularity as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let compactness: u32 = unsafe { ::std::mem::transmute(compactness) };
            compactness as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let contlength: u32 = unsafe { ::std::mem::transmute(contlength) };
            contlength as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let convexity: u32 = unsafe { ::std::mem::transmute(convexity) };
            convexity as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let phi: u32 = unsafe { ::std::mem::transmute(phi) };
            phi as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let elliptic_axis: u32 = unsafe { ::std::mem::transmute(elliptic_axis) };
            elliptic_axis as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let elliptic_shape: u32 = unsafe { ::std::mem::transmute(elliptic_shape) };
            elliptic_shape as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let excentricity: u32 = unsafe { ::std::mem::transmute(excentricity) };
            excentricity as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let moments: u32 = unsafe { ::std::mem::transmute(moments) };
            moments as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let center_area: u32 = unsafe { ::std::mem::transmute(center_area) };
            center_area as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let smallest_rectangle1: u32 = unsafe { ::std::mem::transmute(smallest_rectangle1) };
            smallest_rectangle1 as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let smallest_rectangle2: u32 = unsafe { ::std::mem::transmute(smallest_rectangle2) };
            smallest_rectangle2 as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let smallest_circle: u32 = unsafe { ::std::mem::transmute(smallest_circle) };
            smallest_circle as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let min_max_chord: u32 = unsafe { ::std::mem::transmute(min_max_chord) };
            min_max_chord as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let min_max_chord_gap: u32 = unsafe { ::std::mem::transmute(min_max_chord_gap) };
            min_max_chord_gap as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let rectangularity: u32 = unsafe { ::std::mem::transmute(rectangularity) };
            rectangularity as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct HRegFeature {
    pub def: HRegFeature__bindgen_ty_1,
    pub shape: u8,
    pub is_convex: bool,
    pub is_filled: bool,
    pub is_connected4: bool,
    pub is_connected8: bool,
    pub is_thin: bool,
    pub circularity: f64,
    pub compactness: f64,
    pub contlength: f64,
    pub convexity: f64,
    pub phi: f64,
    pub ra: f64,
    pub rb: f64,
    pub ra_: f64,
    pub rb_: f64,
    pub anisometry: f64,
    pub bulkiness: f64,
    pub structure_factor: f64,
    pub m11: f64,
    pub m20: f64,
    pub m02: f64,
    pub ia: f64,
    pub ib: f64,
    pub row: f64,
    pub col: f64,
    pub area: HIMGCNT,
    pub row1: HIMGCOOR,
    pub col1: HIMGCOOR,
    pub row2: HIMGCOOR,
    pub col2: HIMGCOOR,
    pub row_rect: f64,
    pub col_rect: f64,
    pub phi_rect: f64,
    pub length1: f64,
    pub length2: f64,
    pub row_circle: f64,
    pub col_circle: f64,
    pub radius: f64,
    pub min_chord: HIMGCOOR,
    pub max_chord: HIMGCOOR,
    pub min_chord_gap: HIMGCOOR,
    pub max_chord_gap: HIMGCOOR,
    pub rectangularity: f64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union HRegFeature__bindgen_ty_1 {
    pub single: HFeatureFlags,
    pub all: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HRegFeature__bindgen_ty_1"]
        [::std::mem::size_of::<HRegFeature__bindgen_ty_1>() - 4usize];
    ["Alignment of HRegFeature__bindgen_ty_1"]
        [::std::mem::align_of::<HRegFeature__bindgen_ty_1>() - 4usize];
    ["Offset of field: HRegFeature__bindgen_ty_1::single"]
        [::std::mem::offset_of!(HRegFeature__bindgen_ty_1, single) - 0usize];
    ["Offset of field: HRegFeature__bindgen_ty_1::all"]
        [::std::mem::offset_of!(HRegFeature__bindgen_ty_1, all) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HRegFeature"][::std::mem::size_of::<HRegFeature>() - 264usize];
    ["Alignment of HRegFeature"][::std::mem::align_of::<HRegFeature>() - 8usize];
    ["Offset of field: HRegFeature::def"][::std::mem::offset_of!(HRegFeature, def) - 0usize];
    ["Offset of field: HRegFeature::shape"][::std::mem::offset_of!(HRegFeature, shape) - 4usize];
    ["Offset of field: HRegFeature::is_convex"]
        [::std::mem::offset_of!(HRegFeature, is_convex) - 5usize];
    ["Offset of field: HRegFeature::is_filled"]
        [::std::mem::offset_of!(HRegFeature, is_filled) - 6usize];
    ["Offset of field: HRegFeature::is_connected4"]
        [::std::mem::offset_of!(HRegFeature, is_connected4) - 7usize];
    ["Offset of field: HRegFeature::is_connected8"]
        [::std::mem::offset_of!(HRegFeature, is_connected8) - 8usize];
    ["Offset of field: HRegFeature::is_thin"]
        [::std::mem::offset_of!(HRegFeature, is_thin) - 9usize];
    ["Offset of field: HRegFeature::circularity"]
        [::std::mem::offset_of!(HRegFeature, circularity) - 16usize];
    ["Offset of field: HRegFeature::compactness"]
        [::std::mem::offset_of!(HRegFeature, compactness) - 24usize];
    ["Offset of field: HRegFeature::contlength"]
        [::std::mem::offset_of!(HRegFeature, contlength) - 32usize];
    ["Offset of field: HRegFeature::convexity"]
        [::std::mem::offset_of!(HRegFeature, convexity) - 40usize];
    ["Offset of field: HRegFeature::phi"][::std::mem::offset_of!(HRegFeature, phi) - 48usize];
    ["Offset of field: HRegFeature::ra"][::std::mem::offset_of!(HRegFeature, ra) - 56usize];
    ["Offset of field: HRegFeature::rb"][::std::mem::offset_of!(HRegFeature, rb) - 64usize];
    ["Offset of field: HRegFeature::ra_"][::std::mem::offset_of!(HRegFeature, ra_) - 72usize];
    ["Offset of field: HRegFeature::rb_"][::std::mem::offset_of!(HRegFeature, rb_) - 80usize];
    ["Offset of field: HRegFeature::anisometry"]
        [::std::mem::offset_of!(HRegFeature, anisometry) - 88usize];
    ["Offset of field: HRegFeature::bulkiness"]
        [::std::mem::offset_of!(HRegFeature, bulkiness) - 96usize];
    ["Offset of field: HRegFeature::structure_factor"]
        [::std::mem::offset_of!(HRegFeature, structure_factor) - 104usize];
    ["Offset of field: HRegFeature::m11"][::std::mem::offset_of!(HRegFeature, m11) - 112usize];
    ["Offset of field: HRegFeature::m20"][::std::mem::offset_of!(HRegFeature, m20) - 120usize];
    ["Offset of field: HRegFeature::m02"][::std::mem::offset_of!(HRegFeature, m02) - 128usize];
    ["Offset of field: HRegFeature::ia"][::std::mem::offset_of!(HRegFeature, ia) - 136usize];
    ["Offset of field: HRegFeature::ib"][::std::mem::offset_of!(HRegFeature, ib) - 144usize];
    ["Offset of field: HRegFeature::row"][::std::mem::offset_of!(HRegFeature, row) - 152usize];
    ["Offset of field: HRegFeature::col"][::std::mem::offset_of!(HRegFeature, col) - 160usize];
    ["Offset of field: HRegFeature::area"][::std::mem::offset_of!(HRegFeature, area) - 168usize];
    ["Offset of field: HRegFeature::row1"][::std::mem::offset_of!(HRegFeature, row1) - 172usize];
    ["Offset of field: HRegFeature::col1"][::std::mem::offset_of!(HRegFeature, col1) - 174usize];
    ["Offset of field: HRegFeature::row2"][::std::mem::offset_of!(HRegFeature, row2) - 176usize];
    ["Offset of field: HRegFeature::col2"][::std::mem::offset_of!(HRegFeature, col2) - 178usize];
    ["Offset of field: HRegFeature::row_rect"]
        [::std::mem::offset_of!(HRegFeature, row_rect) - 184usize];
    ["Offset of field: HRegFeature::col_rect"]
        [::std::mem::offset_of!(HRegFeature, col_rect) - 192usize];
    ["Offset of field: HRegFeature::phi_rect"]
        [::std::mem::offset_of!(HRegFeature, phi_rect) - 200usize];
    ["Offset of field: HRegFeature::length1"]
        [::std::mem::offset_of!(HRegFeature, length1) - 208usize];
    ["Offset of field: HRegFeature::length2"]
        [::std::mem::offset_of!(HRegFeature, length2) - 216usize];
    ["Offset of field: HRegFeature::row_circle"]
        [::std::mem::offset_of!(HRegFeature, row_circle) - 224usize];
    ["Offset of field: HRegFeature::col_circle"]
        [::std::mem::offset_of!(HRegFeature, col_circle) - 232usize];
    ["Offset of field: HRegFeature::radius"]
        [::std::mem::offset_of!(HRegFeature, radius) - 240usize];
    ["Offset of field: HRegFeature::min_chord"]
        [::std::mem::offset_of!(HRegFeature, min_chord) - 248usize];
    ["Offset of field: HRegFeature::max_chord"]
        [::std::mem::offset_of!(HRegFeature, max_chord) - 250usize];
    ["Offset of field: HRegFeature::min_chord_gap"]
        [::std::mem::offset_of!(HRegFeature, min_chord_gap) - 252usize];
    ["Offset of field: HRegFeature::max_chord_gap"]
        [::std::mem::offset_of!(HRegFeature, max_chord_gap) - 254usize];
    ["Offset of field: HRegFeature::rectangularity"]
        [::std::mem::offset_of!(HRegFeature, rectangularity) - 256usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Hrlregion {
    pub is_compl: bool,
    pub num: HITEMCNT,
    pub num_max: HITEMCNT,
    pub feature: HRegFeature,
    pub rl: *mut Hrun,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hrlregion"][::std::mem::size_of::<Hrlregion>() - 288usize];
    ["Alignment of Hrlregion"][::std::mem::align_of::<Hrlregion>() - 8usize];
    ["Offset of field: Hrlregion::is_compl"][::std::mem::offset_of!(Hrlregion, is_compl) - 0usize];
    ["Offset of field: Hrlregion::num"][::std::mem::offset_of!(Hrlregion, num) - 4usize];
    ["Offset of field: Hrlregion::num_max"][::std::mem::offset_of!(Hrlregion, num_max) - 8usize];
    ["Offset of field: Hrlregion::feature"][::std::mem::offset_of!(Hrlregion, feature) - 16usize];
    ["Offset of field: Hrlregion::rl"][::std::mem::offset_of!(Hrlregion, rl) - 280usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct Hvrlregion {
    pub is_compl: bool,
    pub num: HITEMCNT,
    pub num_max: HITEMCNT,
    pub feature: HRegFeature,
    pub rc: *mut Hvrun,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hvrlregion"][::std::mem::size_of::<Hvrlregion>() - 288usize];
    ["Alignment of Hvrlregion"][::std::mem::align_of::<Hvrlregion>() - 8usize];
    ["Offset of field: Hvrlregion::is_compl"]
        [::std::mem::offset_of!(Hvrlregion, is_compl) - 0usize];
    ["Offset of field: Hvrlregion::num"][::std::mem::offset_of!(Hvrlregion, num) - 4usize];
    ["Offset of field: Hvrlregion::num_max"][::std::mem::offset_of!(Hvrlregion, num_max) - 8usize];
    ["Offset of field: Hvrlregion::feature"][::std::mem::offset_of!(Hvrlregion, feature) - 16usize];
    ["Offset of field: Hvrlregion::rc"][::std::mem::offset_of!(Hvrlregion, rc) - 280usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hrlaccess {
    pub min: HIMGCOOR,
    pub max: HIMGCOOR,
    pub rl: *mut Hrun,
    pub first: *mut HITEMCNT,
    pub last: *mut HITEMCNT,
    pub no_row: *mut bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hrlaccess"][::std::mem::size_of::<Hrlaccess>() - 40usize];
    ["Alignment of Hrlaccess"][::std::mem::align_of::<Hrlaccess>() - 8usize];
    ["Offset of field: Hrlaccess::min"][::std::mem::offset_of!(Hrlaccess, min) - 0usize];
    ["Offset of field: Hrlaccess::max"][::std::mem::offset_of!(Hrlaccess, max) - 2usize];
    ["Offset of field: Hrlaccess::rl"][::std::mem::offset_of!(Hrlaccess, rl) - 8usize];
    ["Offset of field: Hrlaccess::first"][::std::mem::offset_of!(Hrlaccess, first) - 16usize];
    ["Offset of field: Hrlaccess::last"][::std::mem::offset_of!(Hrlaccess, last) - 24usize];
    ["Offset of field: Hrlaccess::no_row"][::std::mem::offset_of!(Hrlaccess, no_row) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HMultiChannelImage {
    pub channels: *mut Himage,
    pub region: *mut Hrlregion,
    pub num_channels: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HMultiChannelImage"][::std::mem::size_of::<HMultiChannelImage>() - 24usize];
    ["Alignment of HMultiChannelImage"][::std::mem::align_of::<HMultiChannelImage>() - 8usize];
    ["Offset of field: HMultiChannelImage::channels"]
        [::std::mem::offset_of!(HMultiChannelImage, channels) - 0usize];
    ["Offset of field: HMultiChannelImage::region"]
        [::std::mem::offset_of!(HMultiChannelImage, region) - 8usize];
    ["Offset of field: HMultiChannelImage::num_channels"]
        [::std::mem::offset_of!(HMultiChannelImage, num_channels) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hcontvar {
    pub row: *mut HIMGCOOR,
    pub col: *mut HIMGCOOR,
    pub num: HITEMCNT,
    pub max_num: HITEMCNT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hcontvar"][::std::mem::size_of::<Hcontvar>() - 24usize];
    ["Alignment of Hcontvar"][::std::mem::align_of::<Hcontvar>() - 8usize];
    ["Offset of field: Hcontvar::row"][::std::mem::offset_of!(Hcontvar, row) - 0usize];
    ["Offset of field: Hcontvar::col"][::std::mem::offset_of!(Hcontvar, col) - 8usize];
    ["Offset of field: Hcontvar::num"][::std::mem::offset_of!(Hcontvar, num) - 16usize];
    ["Offset of field: Hcontvar::max_num"][::std::mem::offset_of!(Hcontvar, max_num) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hfcontvar {
    pub row: *mut HSUBCOOR,
    pub col: *mut HSUBCOOR,
    pub num: HITEMCNT,
    pub max_num: HITEMCNT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hfcontvar"][::std::mem::size_of::<Hfcontvar>() - 24usize];
    ["Alignment of Hfcontvar"][::std::mem::align_of::<Hfcontvar>() - 8usize];
    ["Offset of field: Hfcontvar::row"][::std::mem::offset_of!(Hfcontvar, row) - 0usize];
    ["Offset of field: Hfcontvar::col"][::std::mem::offset_of!(Hfcontvar, col) - 8usize];
    ["Offset of field: Hfcontvar::num"][::std::mem::offset_of!(Hfcontvar, num) - 16usize];
    ["Offset of field: Hfcontvar::max_num"][::std::mem::offset_of!(Hfcontvar, max_num) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hchain_code {
    pub l: HIMGCOOR,
    pub c: HIMGCOOR,
    pub cc: *mut u8,
    pub num: HITEMCNT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hchain_code"][::std::mem::size_of::<Hchain_code>() - 24usize];
    ["Alignment of Hchain_code"][::std::mem::align_of::<Hchain_code>() - 8usize];
    ["Offset of field: Hchain_code::l"][::std::mem::offset_of!(Hchain_code, l) - 0usize];
    ["Offset of field: Hchain_code::c"][::std::mem::offset_of!(Hchain_code, c) - 2usize];
    ["Offset of field: Hchain_code::cc"][::std::mem::offset_of!(Hchain_code, cc) - 8usize];
    ["Offset of field: Hchain_code::num"][::std::mem::offset_of!(Hchain_code, num) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hline {
    pub row1: HSUBCOOR,
    pub col1: HSUBCOOR,
    pub row2: HSUBCOOR,
    pub col2: HSUBCOOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hline"][::std::mem::size_of::<Hline>() - 16usize];
    ["Alignment of Hline"][::std::mem::align_of::<Hline>() - 4usize];
    ["Offset of field: Hline::row1"][::std::mem::offset_of!(Hline, row1) - 0usize];
    ["Offset of field: Hline::col1"][::std::mem::offset_of!(Hline, col1) - 4usize];
    ["Offset of field: Hline::row2"][::std::mem::offset_of!(Hline, row2) - 8usize];
    ["Offset of field: Hline::col2"][::std::mem::offset_of!(Hline, col2) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hlines {
    pub num: HITEMCNT,
    pub line: *mut Hline,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hlines"][::std::mem::size_of::<Hlines>() - 16usize];
    ["Alignment of Hlines"][::std::mem::align_of::<Hlines>() - 8usize];
    ["Offset of field: Hlines::num"][::std::mem::offset_of!(Hlines, num) - 0usize];
    ["Offset of field: Hlines::line"][::std::mem::offset_of!(Hlines, line) - 8usize];
};
pub type Hhisto_abs = [HIMGCNT; 256usize];
pub type Hhisto_rel = [f64; 256usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hconv_mask_s {
    pub f: i32,
    pub gk: *mut i32,
    pub num_max: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hconv_mask_s"][::std::mem::size_of::<Hconv_mask_s>() - 24usize];
    ["Alignment of Hconv_mask_s"][::std::mem::align_of::<Hconv_mask_s>() - 8usize];
    ["Offset of field: Hconv_mask_s::f"][::std::mem::offset_of!(Hconv_mask_s, f) - 0usize];
    ["Offset of field: Hconv_mask_s::gk"][::std::mem::offset_of!(Hconv_mask_s, gk) - 8usize];
    ["Offset of field: Hconv_mask_s::num_max"]
        [::std::mem::offset_of!(Hconv_mask_s, num_max) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hconv_mask_2 {
    pub min_row: HIMGCOOR,
    pub max_row: HIMGCOOR,
    pub min_col: HIMGCOOR,
    pub max_col: HIMGCOOR,
    pub norm: i32,
    pub num: i32,
    pub row: [HIMGCOOR; 50000usize],
    pub col: [HIMGCOOR; 50000usize],
    pub koor: [HLINCOOR; 50000usize],
    pub m: [i32; 50000usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hconv_mask_2"][::std::mem::size_of::<Hconv_mask_2>() - 600016usize];
    ["Alignment of Hconv_mask_2"][::std::mem::align_of::<Hconv_mask_2>() - 4usize];
    ["Offset of field: Hconv_mask_2::min_row"]
        [::std::mem::offset_of!(Hconv_mask_2, min_row) - 0usize];
    ["Offset of field: Hconv_mask_2::max_row"]
        [::std::mem::offset_of!(Hconv_mask_2, max_row) - 2usize];
    ["Offset of field: Hconv_mask_2::min_col"]
        [::std::mem::offset_of!(Hconv_mask_2, min_col) - 4usize];
    ["Offset of field: Hconv_mask_2::max_col"]
        [::std::mem::offset_of!(Hconv_mask_2, max_col) - 6usize];
    ["Offset of field: Hconv_mask_2::norm"][::std::mem::offset_of!(Hconv_mask_2, norm) - 8usize];
    ["Offset of field: Hconv_mask_2::num"][::std::mem::offset_of!(Hconv_mask_2, num) - 12usize];
    ["Offset of field: Hconv_mask_2::row"][::std::mem::offset_of!(Hconv_mask_2, row) - 16usize];
    ["Offset of field: Hconv_mask_2::col"][::std::mem::offset_of!(Hconv_mask_2, col) - 100016usize];
    ["Offset of field: Hconv_mask_2::koor"]
        [::std::mem::offset_of!(Hconv_mask_2, koor) - 200016usize];
    ["Offset of field: Hconv_mask_2::m"][::std::mem::offset_of!(Hconv_mask_2, m) - 400016usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hconv_mask_1 {
    pub min_col: HIMGCOOR,
    pub max_col: HIMGCOOR,
    pub norm: i32,
    pub num: i32,
    pub col: [HIMGCOOR; 50000usize],
    pub m: [i32; 50000usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hconv_mask_1"][::std::mem::size_of::<Hconv_mask_1>() - 300012usize];
    ["Alignment of Hconv_mask_1"][::std::mem::align_of::<Hconv_mask_1>() - 4usize];
    ["Offset of field: Hconv_mask_1::min_col"]
        [::std::mem::offset_of!(Hconv_mask_1, min_col) - 0usize];
    ["Offset of field: Hconv_mask_1::max_col"]
        [::std::mem::offset_of!(Hconv_mask_1, max_col) - 2usize];
    ["Offset of field: Hconv_mask_1::norm"][::std::mem::offset_of!(Hconv_mask_1, norm) - 4usize];
    ["Offset of field: Hconv_mask_1::num"][::std::mem::offset_of!(Hconv_mask_1, num) - 8usize];
    ["Offset of field: Hconv_mask_1::col"][::std::mem::offset_of!(Hconv_mask_1, col) - 12usize];
    ["Offset of field: Hconv_mask_1::m"][::std::mem::offset_of!(Hconv_mask_1, m) - 100012usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hcolor {
    pub red: u8,
    pub green: u8,
    pub blue: u8,
    pub name: [::std::os::raw::c_char; 40usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hcolor"][::std::mem::size_of::<Hcolor>() - 43usize];
    ["Alignment of Hcolor"][::std::mem::align_of::<Hcolor>() - 1usize];
    ["Offset of field: Hcolor::red"][::std::mem::offset_of!(Hcolor, red) - 0usize];
    ["Offset of field: Hcolor::green"][::std::mem::offset_of!(Hcolor, green) - 1usize];
    ["Offset of field: Hcolor::blue"][::std::mem::offset_of!(Hcolor, blue) - 2usize];
    ["Offset of field: Hcolor::name"][::std::mem::offset_of!(Hcolor, name) - 3usize];
};
pub const cont_class_cont_unknown: cont_class = 0;
pub const cont_class_cont_no_junc: cont_class = 1;
pub const cont_class_cont_start_junc: cont_class = 2;
pub const cont_class_cont_end_junc: cont_class = 3;
pub const cont_class_cont_both_junc: cont_class = 4;
pub const cont_class_cont_closed: cont_class = 5;
pub type cont_class = ::std::os::raw::c_int;
pub use self::cont_class as Hcont_class;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cont_attrib {
    pub name: *mut ::std::os::raw::c_char,
    pub val: *mut HSUBATTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cont_attrib"][::std::mem::size_of::<cont_attrib>() - 16usize];
    ["Alignment of cont_attrib"][::std::mem::align_of::<cont_attrib>() - 8usize];
    ["Offset of field: cont_attrib::name"][::std::mem::offset_of!(cont_attrib, name) - 0usize];
    ["Offset of field: cont_attrib::val"][::std::mem::offset_of!(cont_attrib, val) - 8usize];
};
pub type Hcont_attrib = cont_attrib;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cont_global_attrib {
    pub name: *mut ::std::os::raw::c_char,
    pub val: HSUBATTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cont_global_attrib"][::std::mem::size_of::<cont_global_attrib>() - 16usize];
    ["Alignment of cont_global_attrib"][::std::mem::align_of::<cont_global_attrib>() - 8usize];
    ["Offset of field: cont_global_attrib::name"]
        [::std::mem::offset_of!(cont_global_attrib, name) - 0usize];
    ["Offset of field: cont_global_attrib::val"]
        [::std::mem::offset_of!(cont_global_attrib, val) - 8usize];
};
pub type Hcont_global_attrib = cont_global_attrib;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cont_type {
    pub num: HITEMCNT,
    pub row: *mut HSUBCOOR,
    pub col: *mut HSUBCOOR,
    pub cont_class: Hcont_class,
    pub num_attrib: i32,
    pub attribs: *mut Hcont_attrib,
    pub num_global: i32,
    pub global: *mut Hcont_global_attrib,
    pub h: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cont_type"][::std::mem::size_of::<cont_type>() - 64usize];
    ["Alignment of cont_type"][::std::mem::align_of::<cont_type>() - 8usize];
    ["Offset of field: cont_type::num"][::std::mem::offset_of!(cont_type, num) - 0usize];
    ["Offset of field: cont_type::row"][::std::mem::offset_of!(cont_type, row) - 8usize];
    ["Offset of field: cont_type::col"][::std::mem::offset_of!(cont_type, col) - 16usize];
    ["Offset of field: cont_type::cont_class"]
        [::std::mem::offset_of!(cont_type, cont_class) - 24usize];
    ["Offset of field: cont_type::num_attrib"]
        [::std::mem::offset_of!(cont_type, num_attrib) - 28usize];
    ["Offset of field: cont_type::attribs"][::std::mem::offset_of!(cont_type, attribs) - 32usize];
    ["Offset of field: cont_type::num_global"]
        [::std::mem::offset_of!(cont_type, num_global) - 40usize];
    ["Offset of field: cont_type::global"][::std::mem::offset_of!(cont_type, global) - 48usize];
    ["Offset of field: cont_type::h"][::std::mem::offset_of!(cont_type, h) - 56usize];
};
pub type Hcont = cont_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lin_seg_type {
    pub row: HSUBCOOR,
    pub col: HSUBCOOR,
    pub length: HSUBATTR,
    pub phi: HSUBATTR,
    pub ref_: Hkey,
    pub first: HITEMCNT,
    pub last: HITEMCNT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lin_seg_type"][::std::mem::size_of::<lin_seg_type>() - 32usize];
    ["Alignment of lin_seg_type"][::std::mem::align_of::<lin_seg_type>() - 8usize];
    ["Offset of field: lin_seg_type::row"][::std::mem::offset_of!(lin_seg_type, row) - 0usize];
    ["Offset of field: lin_seg_type::col"][::std::mem::offset_of!(lin_seg_type, col) - 4usize];
    ["Offset of field: lin_seg_type::length"]
        [::std::mem::offset_of!(lin_seg_type, length) - 8usize];
    ["Offset of field: lin_seg_type::phi"][::std::mem::offset_of!(lin_seg_type, phi) - 12usize];
    ["Offset of field: lin_seg_type::ref_"][::std::mem::offset_of!(lin_seg_type, ref_) - 16usize];
    ["Offset of field: lin_seg_type::first"][::std::mem::offset_of!(lin_seg_type, first) - 24usize];
    ["Offset of field: lin_seg_type::last"][::std::mem::offset_of!(lin_seg_type, last) - 28usize];
};
pub type Hline_seg = lin_seg_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poly_type {
    pub num_line: HITEMCNT,
    pub len_line: HITEMCNT,
    pub lines: *mut Hline_seg,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of poly_type"][::std::mem::size_of::<poly_type>() - 16usize];
    ["Alignment of poly_type"][::std::mem::align_of::<poly_type>() - 8usize];
    ["Offset of field: poly_type::num_line"][::std::mem::offset_of!(poly_type, num_line) - 0usize];
    ["Offset of field: poly_type::len_line"][::std::mem::offset_of!(poly_type, len_line) - 4usize];
    ["Offset of field: poly_type::lines"][::std::mem::offset_of!(poly_type, lines) - 8usize];
};
pub type Hpoly = poly_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct para_poly_type {
    pub poly1: Hkey,
    pub poly2: Hkey,
    pub first1: HITEMCNT,
    pub last1: HITEMCNT,
    pub first2: HITEMCNT,
    pub last2: HITEMCNT,
    pub quality: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of para_poly_type"][::std::mem::size_of::<para_poly_type>() - 40usize];
    ["Alignment of para_poly_type"][::std::mem::align_of::<para_poly_type>() - 8usize];
    ["Offset of field: para_poly_type::poly1"]
        [::std::mem::offset_of!(para_poly_type, poly1) - 0usize];
    ["Offset of field: para_poly_type::poly2"]
        [::std::mem::offset_of!(para_poly_type, poly2) - 8usize];
    ["Offset of field: para_poly_type::first1"]
        [::std::mem::offset_of!(para_poly_type, first1) - 16usize];
    ["Offset of field: para_poly_type::last1"]
        [::std::mem::offset_of!(para_poly_type, last1) - 20usize];
    ["Offset of field: para_poly_type::first2"]
        [::std::mem::offset_of!(para_poly_type, first2) - 24usize];
    ["Offset of field: para_poly_type::last2"]
        [::std::mem::offset_of!(para_poly_type, last2) - 28usize];
    ["Offset of field: para_poly_type::quality"]
        [::std::mem::offset_of!(para_poly_type, quality) - 32usize];
};
pub type Hpara_poly = para_poly_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mod_para_type {
    pub poly1: Hkey,
    pub poly2: Hkey,
    pub first1: HITEMCNT,
    pub last1: HITEMCNT,
    pub first2: HITEMCNT,
    pub last2: HITEMCNT,
    pub first1_dist: HSUBATTR,
    pub last1_dist: HSUBATTR,
    pub first2_dist: HSUBATTR,
    pub last2_dist: HSUBATTR,
    pub dir1: i16,
    pub dir2: i16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of mod_para_type"][::std::mem::size_of::<mod_para_type>() - 56usize];
    ["Alignment of mod_para_type"][::std::mem::align_of::<mod_para_type>() - 8usize];
    ["Offset of field: mod_para_type::poly1"]
        [::std::mem::offset_of!(mod_para_type, poly1) - 0usize];
    ["Offset of field: mod_para_type::poly2"]
        [::std::mem::offset_of!(mod_para_type, poly2) - 8usize];
    ["Offset of field: mod_para_type::first1"]
        [::std::mem::offset_of!(mod_para_type, first1) - 16usize];
    ["Offset of field: mod_para_type::last1"]
        [::std::mem::offset_of!(mod_para_type, last1) - 20usize];
    ["Offset of field: mod_para_type::first2"]
        [::std::mem::offset_of!(mod_para_type, first2) - 24usize];
    ["Offset of field: mod_para_type::last2"]
        [::std::mem::offset_of!(mod_para_type, last2) - 28usize];
    ["Offset of field: mod_para_type::first1_dist"]
        [::std::mem::offset_of!(mod_para_type, first1_dist) - 32usize];
    ["Offset of field: mod_para_type::last1_dist"]
        [::std::mem::offset_of!(mod_para_type, last1_dist) - 36usize];
    ["Offset of field: mod_para_type::first2_dist"]
        [::std::mem::offset_of!(mod_para_type, first2_dist) - 40usize];
    ["Offset of field: mod_para_type::last2_dist"]
        [::std::mem::offset_of!(mod_para_type, last2_dist) - 44usize];
    ["Offset of field: mod_para_type::dir1"][::std::mem::offset_of!(mod_para_type, dir1) - 48usize];
    ["Offset of field: mod_para_type::dir2"][::std::mem::offset_of!(mod_para_type, dir2) - 50usize];
};
pub type Hmod_para = mod_para_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ext_para_type {
    pub poly1: Hkey,
    pub poly2: Hkey,
    pub first1: HITEMCNT,
    pub last1: HITEMCNT,
    pub first2: HITEMCNT,
    pub last2: HITEMCNT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ext_para_type"][::std::mem::size_of::<ext_para_type>() - 32usize];
    ["Alignment of ext_para_type"][::std::mem::align_of::<ext_para_type>() - 8usize];
    ["Offset of field: ext_para_type::poly1"]
        [::std::mem::offset_of!(ext_para_type, poly1) - 0usize];
    ["Offset of field: ext_para_type::poly2"]
        [::std::mem::offset_of!(ext_para_type, poly2) - 8usize];
    ["Offset of field: ext_para_type::first1"]
        [::std::mem::offset_of!(ext_para_type, first1) - 16usize];
    ["Offset of field: ext_para_type::last1"]
        [::std::mem::offset_of!(ext_para_type, last1) - 20usize];
    ["Offset of field: ext_para_type::first2"]
        [::std::mem::offset_of!(ext_para_type, first2) - 24usize];
    ["Offset of field: ext_para_type::last2"]
        [::std::mem::offset_of!(ext_para_type, last2) - 28usize];
};
pub type Hext_para = ext_para_type;
pub type Hhom_mat_2d = [[f64; 3usize]; 2usize];
pub type pHhom_mat_2d = *mut [f64; 3usize];
pub type pHhom_mat_2d_const = *const [f64; 3usize];
pub type puHhom_mat_2d = *mut [f64; 3usize];
pub type Hhom_mat_3d = [[f64; 4usize]; 3usize];
pub type pHhom_mat_3d = *mut [f64; 4usize];
pub type puHhom_mat_3d = *mut [f64; 4usize];
pub type Hproj_mat_2d = [[f64; 3usize]; 3usize];
pub type pHproj_mat_2d = *mut [f64; 3usize];
pub type pHproj_mat_2d_const = *const [f64; 3usize];
pub type puHproj_mat_2d = *mut [f64; 3usize];
pub type Hproj_mat_3d = [[f64; 4usize]; 4usize];
pub type pHproj_mat_3d = *mut [f64; 4usize];
pub type puHproj_mat_3d = *mut [f64; 4usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Hfunction_1d {
    pub num: i32,
    pub x: *mut f32,
    pub y: *mut f32,
    pub xmin: f32,
    pub xmax: f32,
    pub xdist: f32,
    pub is_equidist: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Hfunction_1d"][::std::mem::size_of::<Hfunction_1d>() - 40usize];
    ["Alignment of Hfunction_1d"][::std::mem::align_of::<Hfunction_1d>() - 8usize];
    ["Offset of field: Hfunction_1d::num"][::std::mem::offset_of!(Hfunction_1d, num) - 0usize];
    ["Offset of field: Hfunction_1d::x"][::std::mem::offset_of!(Hfunction_1d, x) - 8usize];
    ["Offset of field: Hfunction_1d::y"][::std::mem::offset_of!(Hfunction_1d, y) - 16usize];
    ["Offset of field: Hfunction_1d::xmin"][::std::mem::offset_of!(Hfunction_1d, xmin) - 24usize];
    ["Offset of field: Hfunction_1d::xmax"][::std::mem::offset_of!(Hfunction_1d, xmax) - 28usize];
    ["Offset of field: Hfunction_1d::xdist"][::std::mem::offset_of!(Hfunction_1d, xdist) - 32usize];
    ["Offset of field: Hfunction_1d::is_equidist"]
        [::std::mem::offset_of!(Hfunction_1d, is_equidist) - 36usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union DPHpar {
    pub l: *mut INT4_8,
    pub f: *mut f64,
    pub s: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DPHpar"][::std::mem::size_of::<DPHpar>() - 8usize];
    ["Alignment of DPHpar"][::std::mem::align_of::<DPHpar>() - 8usize];
    ["Offset of field: DPHpar::l"][::std::mem::offset_of!(DPHpar, l) - 0usize];
    ["Offset of field: DPHpar::f"][::std::mem::offset_of!(DPHpar, f) - 0usize];
    ["Offset of field: DPHpar::s"][::std::mem::offset_of!(DPHpar, s) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union DVHpar {
    pub l: INT4_8,
    pub f: f64,
    pub s: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DVHpar"][::std::mem::size_of::<DVHpar>() - 8usize];
    ["Alignment of DVHpar"][::std::mem::align_of::<DVHpar>() - 8usize];
    ["Offset of field: DVHpar::l"][::std::mem::offset_of!(DVHpar, l) - 0usize];
    ["Offset of field: DVHpar::f"][::std::mem::offset_of!(DVHpar, f) - 0usize];
    ["Offset of field: DVHpar::s"][::std::mem::offset_of!(DVHpar, s) - 0usize];
};
pub type HLowLevelErrorCallbackProc =
    ::std::option::Option<unsafe extern "C" fn(err: *const ::std::os::raw::c_char)>;
unsafe extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
